# Combining Data

Practice combining data from two different data sets. In the same folder as this Jupyter notebook, there are two csv files:
* rural_population_percent.csv
* electricity_access_percent.csv

They both come from the World Bank Indicators data. 
* https://data.worldbank.org/indicator/SP.RUR.TOTL.ZS
* https://data.worldbank.org/indicator/EG.ELC.ACCS.ZS

The rural populaton data represents the percent of a country's population that is rural over time. The electricity access data shows the percentage of people with access to electricity.

In [1]:
import pandas as pd
import numpy as np

In [2]:
FILE_PATH_RURAL = 'API_SP.RUR.TOTL.ZS_DS2_en_csv_v2_1743330.csv'
FILE_PATH_ELECT = 'API_EG.ELC.ACCS.ZS_DS2_en_csv_v2_1744929.csv'

In [3]:
# Inpect the csv files first before loading with pandas
def read_lines(n, file) :
    file = open(file) 
    for i in range(n) :
        print(file.readline())
    file.close()

In [4]:
read_lines(5, FILE_PATH_RURAL)

﻿"Data Source","World Development Indicators",



"Last Updated Date","2020-10-15",



"Country Name","Country Code","Indicator Name","Indicator Code","1960","1961","1962","1963","1964","1965","1966","1967","1968","1969","1970","1971","1972","1973","1974","1975","1976","1977","1978","1979","1980","1981","1982","1983","1984","1985","1986","1987","1988","1989","1990","1991","1992","1993","1994","1995","1996","1997","1998","1999","2000","2001","2002","2003","2004","2005","2006","2007","2008","2009","2010","2011","2012","2013","2014","2015","2016","2017","2018","2019","2020",

In [5]:
read_lines(5, FILE_PATH_ELECT)

﻿"Data Source","World Development Indicators",



"Last Updated Date","2020-10-15",



"Country Name","Country Code","Indicator Name","Indicator Code","1960","1961","1962","1963","1964","1965","1966","1967","1968","1969","1970","1971","1972","1973","1974","1975","1976","1977","1978","1979","1980","1981","1982","1983","1984","1985","1986","1987","1988","1989","1990","1991","1992","1993","1994","1995","1996","1997","1998","1999","2000","2001","2002","2003","2004","2005","2006","2007","2008","2009","2010","2011","2012","2013","2014","2015","2016","2017","2018","2019","2020",

# Exercise 1

Combine the two data sets using the [pandas concat method](https://pandas.pydata.org/pandas-docs/stable/merging.html). In other words, find the union of the two data sets.

In [22]:
# TODO: import the pandas library

# TODO: read in each csv file into a separate variable
df_rural = pd.read_csv(FILE_PATH_RURAL, header=2)
df_elecricity = pd.read_csv(FILE_PATH_ELECT, header=2)

# TODO: remove if unnecessary features 
df_rural = df_rural.iloc[:, :64] 
df_electricity = df_elecricity.iloc[:, :64]

# TODO: combine the two data sets together using the concat method
# In other words, all of the rows of df_rural will come first
# followed by all the rows in df_electricity. This is possible to do
# because they both have the same column names.

In [31]:
df_concat = pd.concat([df_rural, df_electricity])
df_concat.shape

(528, 64)

# Exercise 2 (Challenge)

This exercise is more challenging.

Combine the two datas in the csv file together so that the output looks like the following:

|Country Name|Country Code|Year|Rural_Value|Electricity_Value|
|--|--|--|--|--|--|
|Aruba|ABW|1960|49.224|49.239|
... etc.

Order the results in the dataframe by country and then by year

Here are a few pandas methods that should be helpful:
* [melt](http://pandas.pydata.org/pandas-docs/stable/generated/pandas.melt.html)
* [drop](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.drop.html)
* [merge](https://pandas.pydata.org/pandas-docs/version/0.23/generated/pandas.DataFrame.merge.html)
* [sort_values](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.sort_values.html)

HINT: You can use country name, country code, and the year as common keys between the data sets

In [39]:
id_cols = ['Country Name', 'Country Code', 'Indicator Name', 'Indicator Code']

df_rural_melt = df_rural.melt(id_vars=id_cols,
                              var_name='Year', value_name='Rural Value')

df_rural_melt.head(3)

,Country Name,Country Code,Indicator Name,Indicator Code,Year,Rural Value
0,Aruba,ABW,Rural population (% of total population),SP.RUR.TOTL.ZS,1960,49.224
1,Afghanistan,AFG,Rural population (% of total population),SP.RUR.TOTL.ZS,1960,91.599
2,Angola,AGO,Rural population (% of total population),SP.RUR.TOTL.ZS,1960,89.565
3,Albania,ALB,Rural population (% of total population),SP.RUR.TOTL.ZS,1960,69.295
4,Andorra,AND,Rural population (% of total population),SP.RUR.TOTL.ZS,1960,41.550

In [42]:
cols_drop = ['Indicator Name', 'Indicator Code']

df_rural_melt.drop(columns=cols_drop, inplace=True)

In [43]:
df_electricity_melt = df_electricity.melt(id_vars=id_cols, 
                                          var_name='Year', value_name='Electricity Value')
df_electricity_melt.drop(columns=cols_drop, inplace=True)
df_electricity_melt.head()

  Country Name Country Code  Year  Electricity Value
0        Aruba          ABW  1960                NaN
1  Afghanistan          AFG  1960                NaN
2       Angola          AGO  1960                NaN
3      Albania          ALB  1960                NaN
4      Andorra          AND  1960                NaN

In [47]:
# Merge dataframes
df_combined_dirty = pd.merge(df_rural_melt, df_electricity_melt, 
                             on=['Country Name', 'Country Code', 'Year'])

df_combined_dirty.head()

  Country Name Country Code  Year  Rural Value  Electricity Value
0        Aruba          ABW  1960       49.224                NaN
1  Afghanistan          AFG  1960       91.599                NaN
2       Angola          AGO  1960       89.565                NaN
3      Albania          ALB  1960       69.295                NaN
4      Andorra          AND  1960       41.550                NaN

In [54]:
df_combined = df_combined_dirty.sort_values(by=['Country Name', 'Year'])
df_combined = df_combined.reset_index(drop=True)

df_combined

      Country Name Country Code  Year  Rural Value  Electricity Value
0      Afghanistan          AFG  1960       91.599                NaN
1      Afghanistan          AFG  1961       91.316                NaN
2      Afghanistan          AFG  1962       91.024                NaN
3      Afghanistan          AFG  1963       90.724                NaN
4      Afghanistan          AFG  1964       90.414                NaN
...            ...          ...   ...          ...                ...
15835     Zimbabwe          ZWE  2015       67.615          33.700000
15836     Zimbabwe          ZWE  2016       67.704          39.923992
15837     Zimbabwe          ZWE  2017       67.763          40.482048
15838     Zimbabwe          ZWE  2018       67.791          41.041584
15839     Zimbabwe          ZWE  2019       67.790                NaN

[15840 rows x 5 columns]